#--------------------------------------------
# 1. hello world 출력할 것 
#--------------------------------------------

print('hello world')

#--------------------------------------------
# 2. 숫자의 사칙연산 
# 
# 아래의 모든 assert문을 통과하도록 ==의 오른쪽 값을 바꾸세요.
#--------------------------------------------

assert 1 + 3 == 1+3
assert 3 // 3 == 3 // 3
assert 5 % 2 == 1 
assert 6 / 2 == 3

#--------------------------------------------
# 3. 주어진 문자열을 이용해서 다른 문자열 만들어보기 
# 
# 아래에 주어진 문자열 a, b를 이용해서 문자열 c, d를 만들어보세요. 
#--------------------------------------------

a = 'hello' 
b = 'world' 

c = a+' ' + b  #'hello world' 
d = (a+ ' ' + b + ' ') *2 #'hello world hello world' 

print(c)
print(d)

#--------------------------------------------
# 4. n이 짝수면 is even, 아니면 is odd 출력 
#--------------------------------------------

n = 5 
if n // 2 == 0 :
    print('is even')
else :
    print('is odd')
    
# write your code here 

#--------------------------------------------
# 5. len, type, isinstance 함수들 써보기 
#--------------------------------------------
print('len:',len(d))
print('type:',type(c))

if isinstance(n,int) :
    print('n은 int타입 입니다.')
else:
    print('n은 int타입이 아닙니다.')